app/Http/Controllers/ServiceController.php

    public function cache()
    {
        //dd(optional(Cache::get('products'))->toArray());

        /*$products = cache::remember('products',120,function(){

            return Product::latest()->get();
        });*/

        //gate
        /*if(!Gate::allows('product-delete', Product::first()))
        {
            abort(403);
        }*/
        //policies
        //$this->authorize('view',Product::first());

        $products = cache::rememberForever('products',function(){

            return Product::latest()->get();
        });
---
select * from `products` order by `created_at` desc
select * from `products` limit 1